Repository: Tencent-RTC/TUICallKit
Catalog: iOS/TUICallKit/Resources/Localized/*.lproj/CallingLocalized.strings
Languages: ar, ja

# Demo.TRTC.calling.callingrefuse
source: declined the call
ar: رفض المكالمة
ja: 通話拒否

# Demo.TRTC.calling.callingleave
source: left the call
ar: مغادرة المكالمة
ja: 通話終了

# Demo.TRTC.calling.callingnoresponse
source: didnâ€™t answer
ar: لا يوجد استجابة
ja: タイムアウト

# Demo.TRTC.calling.callingbusy
source: is busy
ar: خط مشغول
ja: 相手が通話中です

# Demo.TRTC.calling.invitetovideocall
source: invites you to a video call
ar: يدعوك لمكالمة فيديو
ja: ビデオ通話に招待されました

# Demo.TRTC.calling.invitetoaudiocall
source: invites you to a voice call
ar: يدعوك لمكالمة صوتية
ja: 音声通話に招待されました

# LoginNetwork.AppUtils.determine
source: OK
ar: تأكيد
ja: もちろん

# TUICallKit.Audio.call
source: Voice Call
ar: مكالمة صوتية
ja: 音声通話

# TUICallKit.Video.call
source: Video Call
ar: مكالمة فيديو
ja: ビデオ通話

# Demo.TRTC.Calling.waitaccept
source: Waiting for the user to accept...
ar: انتظار قبول الطرف الآخر
ja: 相手が招待を承諾するのを待っています

# Demo.TRTC.Calling.hangup
source: Hang Up
ar: إنهاء المكالمة
ja: 通話終了

# Demo.TRTC.Calling.decline
source: Decline
ar: رفض
ja: 拒否

# Demo.TRTC.Calling.mic
source: Mic
ar: ميكروفون
ja: マイク

# Demo.TRTC.Calling.speaker
source: Speaker
ar: مكبر الصوت
ja: スピーカー

# Demo.TRTC.Calling.camera
source: Camera
ar: كاميرا
ja: カメラ

# Demo.TRTC.Calling.switchtoaudio
source: Switch to Voice Call
ar: التبديل إلى المكالمة الصوتية
ja: 音声通話に切り替えます

# Demo.TRTC.Calling.answer
source: Answer
ar: الرد
ja: 応答

# Demo.TRTC.Salon.invitelimited
source: The request is being processed, please try again later
ar: الطلب قيد المعالجة ، يرجى المحاولة مرة أخرى لاحقًا
ja: リクエストは処理中です。後でもう一度お試しください。

# Demo.TRTC.Calling.calleeTip
source: They also
ar: هم أيضا هنا
ja: 参加者：

# Demo.TRTC.Calling.FloatingWindow.waitaccept
source: Waiting
ar: في انتظار الرد
ja: 応答を待っています...

# Demo.TRTC.Calling.FloatingWindow.dailing
source: Waiting
ar: الاتصال ...
ja: 電話中...

# Demo.TRTC.Calling.User.Exceed.Limit
source: TUICalling currently supports call with up to 9 people.For larger conference calls,try using TUIRoom
ar: يدعم مكالمات مؤقتة لما يصل إلى 9 أشخاص. لاستخدام المؤتمرات متعددة الأطراف ، يرجى استخدام TUIRoom
ja: 一時的に最大9人の通話をサポートします。多人数の会議が必要な場合は、TUIRoomを使用してください

# Demo.TRTC.Calling.UnableToRestartTheCall
source: Unable to restart the call
ar: لا يمكن إعادة بدء المكالمة أثناء المكالمة
ja: 通話中のため、再度発信できません

# Demo.TRTC.Calling.ErrorInPeerBlacklist
source: The identifier is in blacklist. Failed to send this message!
ar: المعرف في القائمة السوداء. فشل في إرسال هذه الرسالة!
ja: 通話の開始に失敗しました。ユーザーがブラックリストに登録されているため、発信が禁止されています！

# TUICallKit.ErrorInvalidLogin
source: Invalid login, please login again
ar: الرجاء تسجيل الدخول مرة أخرى، تسجيل الدخول غير صحيح
ja: ログイン失敗しました。もう一度ログインしてください

# TUICallKit.ErrorParameterInvalid
source: Parameter error
ar: خطأ المعلمة
ja: パラメータエラー

# TUICallKit.ErrorRequestRefused
source: The current status can not use this function
ar: الحالة الحالية لا تدعم نداء الدالة
ja: 現在の状態では、この機能の呼び出しはサポートされていません

# TUICallKit.ErrorRequestRepeated
source: The current status is waiting/accept, please do not call it repeatedly
ar: الطريقة الحالية تتم تنفيذها، يرجى عدم استدعاءها مرة أخرى
ja: 現在実行中のメソッドを呼び出すことはできません

# TUICallKit.ErrorSceneNotSupport
source: The current scene does not support this function
ar: مشهد المكالمة الحالي لا يدعم هذه الوظيفة
ja: 現在の通話シーンでは、この機能はサポートしていません

# TUICallKit.failedtogetcamerapermission.Title
source: No access to camera
ar: لم يتم تمكين إذن الكاميرا
ja: カメラの権限が開かれていません

# TUICallKit.failedtogetcamerapermission.Tips
source: Unable to use the video call function, click "Authorize Now" to open the camera permission.
ar: لا يمكن استخدام وظيفة المكالمة المرئية ، انقر فوق "فتح" لفتح إذن الكاميرا
ja: ビデオ通話機能が使用できません。"開く"をクリックしてカメラの権限を開きます

# TUICallKit.failedtogetcamerapermission.Later
source: Later
ar: قل ذلك لاحقًا
ja: 後で言う

# TUICallKit.failedtogetcamerapermission.Enable
source: Authorize Now
ar: فتح
ja: 開く

# TUICallKit.failedtogetmicrophonepermission.Title
source: No access to microphone
ar: لم يتم تمكين إذن الميكروفون
ja: マイクの権限が開かれていません

# TUICallKit.failedtogetmicrophonepermission.Tips
source: Unable to use the function of sending audio and video calls, click "Authorize Now" to open the microphone permission
ar: لا يمكن استخدام وظيفة إرسال المكالمات الصوتية والمرئية ، انقر فوق "فتح" لفتح إذن الميكروفون
ja: 音声・ビデオ通話機能が使用できません。"開く"をクリックしてマイクの権限を開きます

# TUICallKit.failedtogetmicrophonepermission.Later
source: Later
ar: قل ذلك لاحقًا
ja: 後で言う

# TUICallKit.failedtogetmicrophonepermission.Enable
source: Authorize Now
ar: فتح
ja: 開く

# TUICallKit.package.not.purchased
source: You do not have TUICallKit package, please open the free experience in the console or purchase the official package
ar: لم تشترِ حزمة قدرات المكالمات الصوتية والمرئية ، يرجى الانتقال إلى لوحة تحكم IM لتجربة مجانية أو شراء الإصدار الرسمي
ja: TUICallKit パッケージを購入していません。コンソールで無料トライアル版をアクティブ化するか、正式版を購入してください。

# TUICallKit.package.not.support
source: The package you purchased does not support this ability
ar: لا يدعم حزمة قدرات المكالمات الصوتية والمرئية التي اشتريتها حاليًا هذه الميزة ، نوصي بترقية نوع الحزمة
ja: 購入したTUICallKitパッケージはこの機能をサポートしていません。パッケージタイプをアップグレードすることをお勧めします。

# TUICallKit.have.new.invitation
source: You have a new call
ar: لديك مكالمة جديدة
ja: 新しい通話があります

# TUICallKit.Recents.all
source: All
ar: جميع المكالمات
ja: すべて

# TUICallKit.Recents.missed
source: Missed
ar: المكالمات الفائتة
ja: 不在着信

# TUICallKit.Recents.calls
source: Recent Calls
ar: سجل المكالمات
ja: 通話履歴

# TUICallKit.Recents.clear
source: Clear
ar: مسح
ja: 削除

# TUICallKit.Recents.done
source: Done
ar: تم
ja: 完了

# TUICallKit.Recents.delete
source: Delete
ar: حذف
ja: 削除

# TUICallKit.Recents.addUser
source: Add User
ar: إضافة عضو
ja: メンバーを招待

# TUICallKit.Recents.clear.all
source: Clear All Call History
ar: مسح جميع السجلات
ja: すべての履歴を消去

# TUICallKit.Recents.clear.cancel
source: Cancel
ar: إلغاء
ja: キャンセル

# TUICallKit.Recents.incoming
source: Incoming
ar: وارد
ja: 着信

# TUICallKit.Recents.outgoing
source: Outgoing
ar: صادر
ja: 発信
